//-----------------------------------------------------------------------------
//!
//!	@file	Camera.h
//!	@brief	カメラ制御
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once


//-----------------------------------------------------------------------------
//!	カメラ
//-----------------------------------------------------------------------------
class Camera : public CameraBase
{
public:

	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	Camera();

	//! 仮想デストラクタ
	virtual ~Camera(){};

	//! 初期化
	virtual bool	init(Vector3& lookAt, Vector3& _rot);

	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! 更新
	//!	@param	[in]	control		コントローラー
	//!	@param	[in]	PlayerPos	プレイヤー座標
	//!	@param	[in]	mouseOffset	マウス座標
	void			update(Controller& control, Vector3& PlayerPos,  POINT mouseOffset);
	//! デバッグ表示
	void			DebugRender();
	
	//@}
private:
	bool			_hitGround;	//!< 地面とヒットチェック
	s32				_myLandScapeGridNum;	//!< ランドスケープ用グリッド番号
};

//=============================================================================
//	END OF FILE
//=============================================================================