//-----------------------------------------------------------------------------
//!
//!	@file	gmMouseManager.cpp
//!	@brief	マウス管理
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#include "stdafx.h"

//-----------------------------------------------------------------------------
//!	コンストラクタ
//-----------------------------------------------------------------------------
MouseManager::MouseManager()
//: _currentCreateCount(0)
: _pMouse(nullptr)
{
	
}

//-----------------------------------------------------------------------------
//!	デストラクタ
//-----------------------------------------------------------------------------
MouseManager::~MouseManager()
{
	SAFE_DELETE(_pMouse);
	/*
	vector<Mouse*>::iterator itr;
	for( itr = _pVecMouse.begin(); itr != _pVecMouse.end(); )
	{
		Mouse* mouse = *itr;
		SAFE_DELETE(mouse);
		itr = _pVecMouse.erase(itr);
	}
	*/
}


//-----------------------------------------------------------------------------
//! マウス作成
//!	@retval 作成したマウスポインタ nullなら失敗
//-----------------------------------------------------------------------------
Mouse*	MouseManager::createMouse()
{
	// マウス作成
	//Mouse*	mouse = new Mouse();
	// 登録
	//_pVecMouse.push_back(controller);
	//return controller;

	SAFE_NEW(_pMouse);
	return _pMouse;
}



//=============================================================================
//	END OF FILE
//=============================================================================