//-----------------------------------------------------------------------------
//!
//!	@file	gmSystemMain.h
//!	@brief	アプリケーションエントリポイント
//!	@author Yuki Ishigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	メインシステム
//-----------------------------------------------------------------------------
class SystemMain
{

public:

	//-------------------------------------------------------------
	//!	@name タスク関数
	//-------------------------------------------------------------
	//@{
	
	//!	メインループ
	//!	@param	[in]	windowClassName	ウィンドウの名前
	//!	@param	[in]	windowTitleName	ウィンドウのタイトル名
	int		mainLoop(GM_CSTR windowClassName, GM_CSTR windotTileName);

	//! 渡されたフラグによってフルスクリーン<->ウィンドウに変更
	//! @param	[in]	isFullScreen フルスクリーンにするかどうか
	void	fullScreen(bool isFullScreen);

	//@}
	//-------------------------------------------------------------
	//!	@name 取得
	//-------------------------------------------------------------
	//@{

	//! インスタンス取得
	static SystemMain* getInstance() {
		static SystemMain	_myInstance;
		return &_myInstance;
	}
	
	//@}
protected:
	//-------------------------------------------------------------
	//!	@name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	SystemMain(){}
	//! コピーコンストラクタ
	SystemMain(SystemMain& dst){}
	//! デストラクタ
	virtual ~SystemMain(){}

	//@}
	//-------------------------------------------------------------
	//!	@name 継承カスタマイズする関数
	//-------------------------------------------------------------
	//@{

	//! 初期化コールバック
	virtual bool	onInitialize() { return true; }

	//! 解放コールバック
	virtual void	onFinalize() {}

	//@}
	
	////! ウィンドウプロシージャ
	//virtual LRESULT		wndProc(HWND hwnd, UINT message, WPARAM wparam, LPARAM lparam);
	//
	////!	ウィンドウプロシージャ(WindowsOSからのコールバック)
	//static LRESULT CALLBACK	wndProc__(HWND hwnd, UINT message, WPARAM wparam, LPARAM lparam);
};

//-----------------------------------------------------------------------------
// アクセスインターフェイス
//-----------------------------------------------------------------------------
__forceinline
SystemMain* GmMain()
{
	return SystemMain::getInstance();
}



//=============================================================================
//	END OF FILE
//=============================================================================
