//-----------------------------------------------------------------------------
//!
//!	@file	gmSystemAsset.h
//!	@brief	アセット管理システム
//!	@author Yuki Ishigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	アセット管理
//-----------------------------------------------------------------------------
class SystemAsset
{
public:

	//! 初期化
	bool		init();
	//! 解放
	void		cleanup();

	//-------------------------------------------------------------
	//!	@name	アセット作成
	//-------------------------------------------------------------
	//@{

	//! アセットの読み込み作成
	//!	@param	[in]	type	アセットの型情報
	//!	@param	[in]	path	ファイルパス
	//!	@return	アセットのクラス (nullptrなら失敗)
	AssetBase*	create(const Type& type, GM_CSTR path);

	//@}
	//-------------------------------------------------------------
	//!	@name 取得
	//-------------------------------------------------------------
	//@{

	//! インスタンス取得
	static SystemAsset* getInstance() {
		static SystemAsset	_myInstance;
		return &_myInstance;
	}

	//@}
private:
	//-------------------------------------------------------------
	//!	@name	初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	SystemAsset();
	//! コピーコンストラクタ
	SystemAsset(SystemAsset& src){};
	//! デストラクタ
	virtual ~SystemAsset();

	//@}
};

//--------------------------------------------------------------
// アクセスインターフェイス
//--------------------------------------------------------------
__forceinline
SystemAsset* GmAsset()
{
	return SystemAsset::getInstance();
}


//=============================================================================
//	END OF FILE
//=============================================================================