//-----------------------------------------------------------------------------
//!
//!	@file	gmTaskFilterLensFlare.h
//!	@brief	レンズフレア
//!	@author YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	レンズフレア
//-----------------------------------------------------------------------------
class TaskFilterLensFlare : public TaskFilter
{
public:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	TaskFilterLensFlare();

	//! デストラクタ
	virtual ~TaskFilterLensFlare();

	//@}
	//-------------------------------------------------------------
	//!	@name	タスク関数
	//! 関数を継承してカスタムします。
	//-------------------------------------------------------------
	//@{

	//! 初期化
	virtual bool		setup();

	//! 解放
	virtual void		cleanup();

	//! 並列更新
	virtual void		asyncUpdate(){}

	//! 直列更新
	virtual void		update(){}

	//! 描画
	virtual void		render();

	//@}
private:

	Texture*			_lensColorTex;
	Texture*			_lensDirtTex;
	Texture*			_lensStarBurstTex;
	
	//---- 作業用テクスチャ
	Texture*			_accumTexture;			//!< 蓄積用テクスチャ
	Texture*			_stockTexture;			//!< 一時保存用
	Texture*			_bilenarExpandTex[2];	//!< 2倍に拡大用
};


//=============================================================================
//	END OF FILE
//=============================================================================