//-----------------------------------------------------------------------------
//!
//!	@file	gmTaskFilterTonemapping.h
//!	@brief	トーンマッピングフィルター
//!	@author YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	トーンマッピングフィルター
//-----------------------------------------------------------------------------
class TaskFilterToneMapping : public TaskFilter
{
public:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	TaskFilterToneMapping();

	//! デストラクタ
	virtual ~TaskFilterToneMapping();

	//@}
	//-------------------------------------------------------------
	//!	@name	タスク関数
	//! 関数を継承してカスタムします。
	//-------------------------------------------------------------
	//@{

	//! 初期化
	virtual bool		setup();

	//! 解放
	virtual void		cleanup();

	//! 並列更新
	virtual void		asyncUpdate(){}

	//! 直列更新
	virtual void		update(){}

	//! 描画
	virtual void		render();

	//@}
private:
	Texture*			_pAdaptationTexture[2];	// 順応値
	s32					_adaptationIndex;
};


//=============================================================================
//	END OF FILE
//=============================================================================