//-----------------------------------------------------------------------------
//!
//!	@file	CollisionObject.cpp
//!	@brief	オブジェクト当たり判定用
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#include "Library.h"

//-----------------------------------------------------------------------------
//! オブジェクトとの当たり判定
//! @param	[in]	obj			当たり判定を行いたいオブジェクト
//-----------------------------------------------------------------------------
bool CollisionObject::isHitObj(ObjBase*	obj)
{
	return isHitSphere(obj->getHitSphere());
}
//-----------------------------------------------------------------------------
//! オブジェクトと攻撃とのあたり判定
//! @param	[in]	attackSphere	当たり判定を行いたい攻撃の球
//-----------------------------------------------------------------------------
bool CollisionObject::isHitSphere(Sphere&	attackSphere)
{
	return _hitSphere.isHit(attackSphere);
}

//=============================================================================
//	END OF FILE
//============================================================================