//-----------------------------------------------------------------------------
//!
//!	@file	EnemyLeader.h
//!	@brief	敵リーダータイプ
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

// ここでmyNameをマクロで宣言
//! 名前と一致するかどうか
DEF_COL_NAME_HEADER(EnemyLeader);
DEF_COL_ATTACK_NAME_HEADER(EnemyLeaderAttack);
//-----------------------------------------------------------------------------
//! 敵攻撃タイプ
//-----------------------------------------------------------------------------
class EnemyLeader : public EnemyBase
{
public:

	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	EnemyLeader();

	//! デストラクタ
	virtual			~EnemyLeader();
	//! 初期化
	virtual bool	Initialize();

	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! 更新
	virtual void	Update();
	//! 更新
	virtual void	UpdateByCommand();

	//! リーダーの周りに常にいる
	//!	@param	[in]	leader	プレイヤー座標
	virtual void	UpdateNormal(Vector3& leaderPos);
	
	//! 描画
	virtual void	Render(bool	isShadow);

	//@}
protected:
	Vector3			_deffencePos;		//!< 防衛座標
};

//=============================================================================
//	END OF FILE
//=============================================================================