//-----------------------------------------------------------------------------
//!
//!	@file	EnemyAttacker.h
//!	@brief	敵攻撃タイプ
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

// ここでmyNameをマクロで宣言
//! 名前と一致するかどうか
DEF_COL_NAME_HEADER(EnemyAttacker);
DEF_COL_ATTACK_NAME_HEADER(EnemyAttakerAttack);
//-----------------------------------------------------------------------------
//! 敵攻撃タイプ
//-----------------------------------------------------------------------------
class EnemyAttacker : public EnemyBase
{
public:

	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	EnemyAttacker();

	//! デストラクタ
	virtual			~EnemyAttacker();
	//! 初期化
	virtual bool	Initialize();

	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! 更新
	virtual void	Update();
	//! 更新
	virtual void	UpdateByCommand();

	//! リーダーの周りに常にいる
	//!	@param	[in]	leader	プレイヤー座標
	virtual void	UpdateNormal(Vector3& leaderPos);
	
	//! 描画
	virtual void	Render(bool	isShadow);

	//@}
};

//=============================================================================
//	END OF FILE
//=============================================================================