//-----------------------------------------------------------------------------
//!
//!	@file	KeyDeffender.h
//!	@brief	防御(護衛)タイプの操作
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	AI(防御タイプ)
//-----------------------------------------------------------------------------
class KeyDeffender : public AI
{
public:
	//! 行動状態
	//@{

	enum MODE
	{
		MODE_APPROACH,	//!< 目標に接近
		MODE_ATTACK,	//!< 敵攻撃
		MODE_DEFFENCE,	//!< 目標を防御
		MODE_MAX		//!< 状態遷移の最大
	};

	//@}
public:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! デフォルトコンストラクタ
	KeyDeffender(Man* me, Man* leader);
	//! デストラクタ
	virtual ~KeyDeffender();

	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! 更新
	virtual void Update();
	
	//@}
protected:
	f32				_searchRot;			//!< 探索方向
	f32				_attackReach;		//!< 攻撃可能範囲
	f32				_deffenceReach;		//!< 目標を防御するための距離
	bool			_deffenceMode;		//!< ディフェンスモードがどうか
	MODE			_mode;				//!< 行動状態用
};


//=============================================================================
//	END OF FILE
//=============================================================================