//-----------------------------------------------------------------------------
//!
//!	@file	LightManager.h
//!	@brief	光源管理クラス
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//! 光源管理クラス
//-----------------------------------------------------------------------------
class LightManager
{
private:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//---- 外部からの作成削除禁止
	//! コンストラクタ
	LightManager();
	//! コピーコンストラクタ
	LightManager(LightManager& src){}
	//! デストラクタ
	virtual ~LightManager();

	//@}
public:
	//-------------------------------------------------------------
	//! @name 取得/設定
	//-------------------------------------------------------------
	//@{

	//! インスタンスの取得
	static LightManager*		getInstance()
	{
		static LightManager _myInstance;
		return &_myInstance;
	}

	//! 指定したインデックスのライト取得
	LightBase*					getLight(u32 Index) {
		if( Index >= _pVecLight.size() ) return nullptr;
		return _pVecLight.at(Index);
	}

	//! ライトを探す
	//!	@param	[in]	search	探すライトのポインタ
	bool					sameLight(LightBase* search);


	//@}
	//-------------------------------------------------------------
	//! @name 登録/解除
	//-------------------------------------------------------------
	//@{

	//! 登録
	void					regist(LightBase* light);
	//! 解除
	void					unregist(LightBase* light);


	//@}



private:
	vector<LightBase*>			_pVecLight;

};

//-----------------------------------------------------------------------------
// アクセスインターフェイス
//-----------------------------------------------------------------------------
__forceinline
LightManager*	ILight()
{
	return LightManager::getInstance();
}

//=============================================================================
//	END OF FILE
//=============================================================================