//-----------------------------------------------------------------------------
//!
//!	@file	Light.cpp
//!	@brief	ライト制御
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#include "Library.h"

//-----------------------------------------------------------------------------
//! コンストラクタ
//-----------------------------------------------------------------------------
Light::Light()
{
	setPosition(Vector3(1.12f, 1.43f, 1.13f));
	setLookAt(Vector3(0,0,0));
}

//-----------------------------------------------------------------------------
//! デストラクタ
//-----------------------------------------------------------------------------
Light::~Light()
{
}

//-----------------------------------------------------------------------------
//! 更新
//-----------------------------------------------------------------------------
void Light::update()
{
	float moveSpeed = 0.01f;
	//---- ライト移動処理(デバッグ用)
	if( GetKeyState(VK_UP)    &0x80 ){ 
		_position._z += moveSpeed; 
	}
	if( GetKeyState(VK_DOWN)  &0x80 ){
		_position._z -= moveSpeed; 
	}
	if( GetKeyState(VK_RIGHT) &0x80 ){
		_position._x += moveSpeed; 
	}
	if( GetKeyState(VK_LEFT)  &0x80 ){
		_position._x -= moveSpeed; 
	}

	if( GetKeyState(VK_HOME)  &0x80 ){
		_position._y += moveSpeed;
	}
	if( GetKeyState(VK_END)   &0x80 ){
		_position._y -= moveSpeed;
	}

	LightBase::update();
}

//-----------------------------------------------------------------------------
//! デバッグ表示
//-----------------------------------------------------------------------------
void Light::DebugRender()
{
	glColor4f(1.0f, 1.0f, 1.0f, 1.0f);
	DebugPointRender(_position);
	glColor4f(1.0f, 0.0f, 0.0f, 1.0f);
	Line line;
	line._position[0] = _position;
	line._position[1] = line._position[0] + Vector3(0.0f, -1000.0f, 0.0f);
	line.DebugRender();
}

//=============================================================================
//	END OF FILE
//=============================================================================