//-----------------------------------------------------------------------------
//!
//!	@file	Mouse.h
//!	@brief	マウス制御
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once
//-----------------------------------------------------------------------------
//! @class	マウス制御
//-----------------------------------------------------------------------------
class Mouse
{
public:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	Mouse();

	//! デストラクタ
	virtual ~Mouse();


	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! 1フレーム分の更新
	void		Update();
	
	//! マウスホイール
	void		MouseWheel(int wheel_number, int direction, int x, int y);

	//@}
	//-------------------------------------------------------------
	//! @name 取得・設定
	//-------------------------------------------------------------
	//@{

	//! 現在のカーソル位置を取得
	POINT		getPosition() const { return _point; }

	//! カーソル移動量を取得
	POINT		getOffset() const;


	//! ホイール変更量取得
	f32			getChangeWheel(){ 
		f32 result = _changeWheel;
		// 取得したら０にする
		_changeWheel = 0.0f;
		return result; 
	}
	
	//@}
private:

	POINT		_oldPoint;		//!< 1フレーム前の位置座標
	POINT		_point;			//!< 現在の位置座標

	//---- マウスホイール
	s32			_oldWheel;		//!< 1フレーム前のホイール値
	s32			_wheel;			//!< 現在のホイール値
	f32			_changeWheel;	//!< ホイール変更量
};

//=============================================================================
//	END OF FILE
//=============================================================================