//-----------------------------------------------------------------------------
//!
//!	@file	SkyBox.h
//!	@brief	スカイボックス
//!	@author	YukiIshigaki
//!
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//!	スカイボックス
//-----------------------------------------------------------------------------
class SkyBox
{
public:
	//-------------------------------------------------------------
	//! @name 初期化
	//-------------------------------------------------------------
	//@{

	//! コンストラクタ
	SkyBox(){};
	//! デストラクタ
	~SkyBox(){};

	//! 初期化
	bool	init();

	//@}
	//-------------------------------------------------------------
	//! @name タスク関数
	//-------------------------------------------------------------
	//@{

	//! スカイボックスの作成
	//! @param	[in]	directory ファイルへのディレクトリ
	//! @param	[in]	front	  正面の画像ファイル名
	//! @param	[in]	back	  後面の画像ファイル名
	//! @param	[in]	left	  左面の画像ファイル名
	//! @param	[in]	right	  右面の画像ファイル名
	//! @param	[in]	top		  上面の画像ファイル名
	//! @param	[in]	bottom	  下面の画像ファイル名
	void	loadSkyBox(string directory,
					   string front,
					   string back,
					   string left,
					   string right,
					   string top,
					   string bottom);

	//! 描画
	void	render();

	//! デバッグ描画
	void	debugRender();

	//@}
	//-------------------------------------------------------------
	//! @name 取得/設定
	//-------------------------------------------------------------
	//@{

	//@}

private:
	
	GLuint		_skyBoxTextureHandle;	//!< SkyBoxのキューブテクスチャハンドル
	GLuint		_vbo_cube_vertices;		//!< キューブ用の頂点バッファオブジェクト
	GLuint		_ibo_cube_indices;		//!< キューブ用のインデックスバッファオブジェクト


	Texture		texture[6];			//!< SkyBoxのテクスチャ

	Texture		debugTexture;		//!< デバッグ用

	f32			_dim;
	
};

//=============================================================================
//	END OF FILE
//=============================================================================